# Вы можете расположить сценарий своей игры в этом файле.

# Глобальные настройки
define debug = True
define config.menu_include_disabled = debug
define config.rollback_enabled = debug
define config.default_afm_enable = debug
define quick_menu = debug
default preferences.afm_enable = debug
default preferences.afm_after_click = debug

define config.has_autosave = False
define config.autosave_on_choice = False
define config.autosave_on_quit = False
define config.autosave_frequency = None
define config.keymap['quick_save'] = []
define config.keymap['quick_load'] = []
define config.default_textshader = "typewriter"

# Флаги истории
define hero_selected = False

# Флаги квестов и прогресса
define beggar_flag_help = False
define agatha_release_flag = False
define council_help_flag = False

# Сценарий
label start:
    $ quick_menu = debug
    $ _skipping = debug
    $ _game_menu_screen = None
    $ preferences.afm_enable = not debug
    $ preferences.afm_time = 10.0

    play music "audio/main_theme.m4a"

    $ hard_fade("morvein_start", 3.0)

    "Дождь шел уже шестой день подряд.
    Морвейн всегда пах одинаково: мокрым камнем, 
    свечным воском и затхлой водой из старых каналов."

    "Горожане давно перестали замечать этот запах. Как и многое другое."

    "Ночные колокола.
    Людей, засыпающих прямо посреди разговора.
    Детей, которые по утрам рассказывают о местах, где никогда не были."

    "В Морвейне привыкли не задавать лишних вопросов. Особенно ночью."

    "Но ты оказался здесь не случайно.
    У каждого,
    кто приезжает в Морвейн,
    есть своя причина.
    Своя история."
    "И свои сны."

    with fade
    call screen char_choice()
    $ result = _return
    with fade

    # Обрабатываем выбор героя
    if result == "choice_1":
        $ hero = Hero(
            name = "Мильтон", 
            full_name = "брат Мильтон", 
            prof = PROF.MONK, 
            state = STATE.HEALTHY, 
            humanity = 2, 
            will = 4, 
            aspect = 7, 
            control = 7, 
            dream = 3, 
            ord_rel = 3, 
            cult_rel = 0, 
            image="images/chars/hero_milton_idle.png", 
            color="#f00")
        
        "Когда-то ты уже жил в Морвейне.
        Годы спустя ты почти убедил себя,
        что детские молитвы,
        доносящиеся из-под собора,
        были лишь кошмаром.
        Но прошлой ночью ты снова услышал их во сне."
    elif result == "choice_2":
        $ hero = Hero(
            name = "Фальк", 
            full_name = "доктор Фальк", 
            prof = PROF.DOCTOR, 
            state = STATE.HEALTHY, 
            humanity = 7, 
            will = 7, 
            aspect = 2, 
            control = 4, 
            dream = 0, 
            ord_rel = 0, 
            cult_rel = 0, 
            image = "images/chars/hero_falk_idle.png", 
            color="#593ed0")

        "Первого пациента привели к тебе четыре дня назад.
        Мальчик не просыпался двое суток.
        Во сне он неустанно повторял одно слово на неизвестном языке."
        "Через день он исчез из палаты."

    $ hero_selected = True

    "Морвейн никогда не засыпал.
    По крайней мере,
    не так, как другие города."
    "Даже глубокой ночью
    в переулках горел свет.
    Люди ходили быстро,
    редко смотрели друг другу в глаза
    и всегда запирали двери до наступления темноты."

    "Над городом возвышался собор Ордена.
    Звон его колоколов определял жизнь Морвейна: когда работать, когда молиться, когда оставаться дома."
    "Говорили, что монахи могут распознать лунатика еще до того, как тот впервые заговорит во сне."

    "Под улицами Морвейна тянулись старые катакомбы.
    Некоторые тоннели давно обрушились.
    Некоторые — исчезли с карт Ордена."

    "Люди перешептывались между собой,
    что из этих катакомб по ночам можно услышать тяжелые шаги
    там, где уже много лет никого не было."

    "За северными воротами начинался лес, сырой и слишком тихий."
    "Дети иногда уходили туда во сне. И не всегда возвращались назад."

    "По разговорам людей становилось очевидным, что сон все сильнее проникает в Морвейн.
    И нынешний настоятель Ордена просил твоей помощи."

    menu:
        "Отправиться в собор":
            jump morvein_streets

label morvein_streets:
    scene morvein_streets_mix
    with fade

    "Чем глубже ты заходишь в город, тем больше удушливое чувство всеобщего страха проникает в тебя."
    "Люди стараются не задерживаться на улицах. Некоторые, заметив твой взгляд, сразу опускают голову."

    "У перекрестка ты замечаешь человека, неподвижно стоящего под дождем с закрытыми глазами."
    "Словно почуяв твое присутствие издалека, он начинает медленно идти в твою сторону."
    "Ты ускоряешь шаг и переходишь на соседнюю улицу, продолжая двигаться вперед."

    with fade
    
    "Из приоткрытого окна доносится приглушенный спор."
    "— Нужно было отвести мальчика в собор раньше, он почти не просыпается...
    \n— Замолчи!"
    "Голоса резко стихают, когда ты проходишь мимо."

    with fade

    "Впереди снова звучит колокол, на этот раз ближе. Гул медленно прокатывается по улицам Морвейна, 
    и тебе кажется, будто город на мгновение замирает, прислушиваясь к нему."

    "Двое прохожих торопливо проходят мимо тебя"
    "— Говорят, этой ночью снова видели культистов у катакомб..."
    "Остаток фразы тонет в шуме дождя."

    "Дойдя до конца очередной тесной улицы, ты видишь как впереди сквозь туман проступают темные шпили собора." 

    jump temple_outside   

label temple_outside:
    scene temple_outside with fade

    "Собор Ордена возвышается над Морвейном,
    словно исполинский часовой.
    Его башни теряются в тумане,
    а дождь стекают по черному камню,
    будто собор никогда не высыхает полностью."

    "На фасаде нет ни ликов святых,
    ни привычных символов веры - 
    только фигуры с закрытыми глазами и опущенными головами.
    Кажется, будто так они прислушиваются ко всему происходящему вокруг."

    "Главные ворота настолько высоки,
    что человек рядом с ними кажется ребенком.
    Тяжелые створки покрывают резные узоры,
    напоминающие не то волны, не то человеческие веки."

    "Говорили,
    что монахи Ордена почти не спят.
    Что под собором находятся старые залы,
    куда не допускают даже послушников."

    "И что иногда,
    если долго стоять у стен в полной тишине,
    можно услышать пение,
    доносящееся откуда-то снизу."

    "Когда ты подходишь к храму ближе,
    колокола над городом снова начинают тревожно звучать.
    словно предупреждая Морвейн о чьем-то прибытии."

    "У стены собора сидит сгорбленный калека,
    укрывшись рваным плащом от дождя.
    Одна его нога заканчивается ниже колена,
    а пальцы дрожат так сильно,
    будто он никак не может согреться.
    Перед ним лежит деревянная чаша,
    почти пустая."

    "Когда ты проходишь мимо, то он обращает на тебя свой полуслепой взгляд, устремленный куда-то вдаль."

    show beggar default:
        xalign 0.5
        yalign 1.0
    with dissolve

    if hero.prof == PROF.MONK:
        "Заметив на твоих одеждах знаки Ордена, попрошайка с почтительным ужасом отходит в сторону, пропуская тебя к дверям собора."
    else:
        beggar "Они снова поют сегодня ночью..."
        beggar "Значит, кто-то опять не проснется..."
        beggar "Опять..."
        
        menu:
            "Бросить монетку":
                "Поравнявшись с ним, ты кидаешь несчастному монетку в его почти пустую чашу. Взгляд нищего на секунду становится осмысленным, и он благодарно кивает."
                $ add_stat(hero, "humanity", 1)
                $ beggar_flag_help = True
            "Пройти мимо":
                "Ты проходишь мимо, решив, что перед тобой очередной безумец, сломленный Морвейном."

    "Оставив калеку за спиной, ты входишь в едва приоткрытые двери собора."

    stop music fadeout 3.0

    jump temple_inside

label temple_inside:
    scene temple_inside with fade

    play music "<from 52.0>audio/temple.mp3" fadein 3.0

    "Внутри собора почти темно. Высокие своды теряются где-то наверху, за дымом свечей и тенями."
    "Шаги звучат непривычно глухо, будто камень под ногами поглощает эхо."
    "Вдоль стен тянутся ряды деревянных скамей, на которых спят люди."

    "У алтаря ходят монахи в поизносившихся одеяниях. Некоторые молятся, некоторые будто прямо стоя, неподвижно склонив головы."

    "Двое монахов осторожно проводят через зал мальчика лет десяти. Ребенок идет босиком с закрытыми глазами, едва переставляя ноги."
    "Когда один из монахов берет его за плечо, мальчик никак не реагирует, словно находится где-то бесконечно далеко отсюда."
    "В дальнем конце зала ты замечаешь еще нескольких спящих детей, лежащих под темными покрывалами."

    "Чуть дальше ты видишь, как один молодой монах, несущий ведро воды, на мгновение останавливается посреди прохода."
    "Его взгляд становится пустым, а ведро выскальзывает из рук, с глухим стуком ударяясь о пол."
    "Лишь через несколько секунд он приходит в себя и поднимает упавшее ведро, избегая чужих взглядов."

    "Где-то в глубине собора слышится негромкое и монотонное пение. 
    Несколько голосов повторяют одну и ту же фразу снова и снова, словно убаюкивают ребенка."

    show stefan default at center
    with dissolve

    "Из темноты впереди появляется фигура монаха."
    "Высокий, болезненно бледный человек с глубоко запавшими глазами внимательно смотрит на тебя."

    stefan "Добро пожаловать в собор Ордена." 
    stefan "Я отец Стефан, его настоятель."
    stefan "Полагаю, вы уже видели, что происходит в городе?"

    menu:
        "Люди здесь боятся вас.":
            stefan "Страх — частая цена за порядок."
            $ hero.ord_rel -= 1
        "Да, люди напуганы. Без ваших усилий город охватила бы паника.":
            stefan "Делаем все, что в наших силах."
            $ hero.ord_rel += 1

    stefan "Мы лишь пытаемся удержать то, что еще можно удержать."

    stefan "Сегодня утром мы поймали одного из культистов у северных катакомб."
    stefan "Обычно они предпочитают смерть разговору. Но этот сам попросил привести его сюда."

    if hero.prof == PROF.MONK:
        stefan "Я как раз собирался допросить его лично. Если вы не против, продолжим наш разговор внизу."
        jump temple_interrogation_room
    else:
        stefan "Я как раз собирался допросить его лично. Подождите меня в храмовой лечебнице, и мы продолжим наш разговор. 
        Если хотите, то можете осмотреть больных."
        jump temple_hospital
        
label temple_interrogation_room:
    scene temple_interrogation_room
    with fade

    "Вы вдвоем спускаетесь в комнату для допроса. Тяжелая дверь со скрипом закрывается за вашей спиной."
    "В воздухе стоит тяжелый запах — смесь человеческого пота и запекшейся крови."
    "Каменные стены покрыты потемневшими символами Ордена, а единственный фонарь под потолком едва разгоняет темноту.
    В центре комнаты, прикованный к деревянному креслу цепями, сидит пленник."

    show cultist default at center
    with dissolve

    "Его голова с грязными волосами опущена, а губы едва заметно шевелятся, словно произнося немую молитву."
 
    menu:
        "Почему вы держите его в таком состоянии? Он сдался вам добровольно." if hero.humanity > 1:
            hide cultist
            show stefan default at center
            with dissolve
            stefan "Ты, видимо, не знаешь, на что они способны."
            $ add_stat(hero, "humanity", 1)
        "Что вы от него уже узнали?":
            hide cultist
            show stefan default at center
            with dissolve
            stefan "Он отказывается говорить."

    hide stefan
    show cultist default at center
    with dissolve

    "Пленник медленно поднимает голову. Его глаза останавливаются прямо на тебе, и он с усмешкой улыбается."
    cultist "Ты уже видел их?"

    menu:
        "..." if hero.dream > 0:
            cultist "Вижу, ты понимаешь, о чем я говорю."
            "Культист продолжает криво улыбаться."
        "О чем ты?" if hero.dream == 0:
            cultist "Значит, время еще не пришло. Скоро."
            "Культист продолжает криво улыбаться."

    cultist "Ты ведь слышал колокола, правда? Все всегда начинаются с колоколов."
    cultist "Они всегда звучат перед Приливом. "
    cultist "Главное — не отвечай, если услышишь свое имя."
    "Голос культиста становится серьезным."
    cultist "Ты уже наверняка обратил внимание на всех этих спящих наверху."
    cultist "Орден считает, что они могут их вылечить. Наивные болваны."

    hide cultist
    show stefan default at center
    with dissolve

    stefan "Довольно!"
    "Отец Стефан делает резкий шаг по направлению к узнику с поднятой рукой, явно намереваясь заставить его замолчать."

    stop music fadeout 7.0

    "Неожиданно звуки хора наверху резко смолкают. В возникшей тишине слышно лишь нервное дыхание пленника и удары капель дождя о купол собора."
    "По лицу отца Стефана становится понятно, что такого прежде не происходило."
    stefan "Наверх, быстро!"

    jump awakening_temple

label temple_hospital:
    scene temple_hospital with fade

    "Пока отец Стефан медленно спускается по лестнице в комнату для допросов, один из служителей проводит тебя в храмовую лечебницу."

    "В самом помещении вдоль стен стоят наспех скроенные койки, занятые спящие людьми разного возраста. 
    Некоторые что-то тихо бормочут во сне, другие лежат совершенно неподвижно, словно погрузились в безвременный отдых."

    "Осматривая пациентов, ты быстро понимаешь, почему местные считают происходящее болезнью."
    "У многих наблюдаются одинаковые признаки: истощение, холодные исхудавшие руки с проступившими синими венами и темные круги под глазами."

    "Рядом с тобой несколько монахов ухаживают за детьми, которых болезнь поразила особенно сильно. 
    Один мальчик внезапно садится на кровати, произвонит несколько бессвязных слов и снова ложится, даже не проснувшись."

    "Сквозь открытый проем до тебя доносится пение хора. Оно сопровождало тебя все время с момента прибытия в собор и давно превратилось 
    в часть окружающего шума. Поэтому в какой-то момент ты даже не не понимаешь, что случилось." 
    
    "Лишь спустя несколько секунд приходит осознание: хор замолчал."

    "Над лечебницей мгновенно застывает напряжение. Через мгновение несколько спящих пациентов одновременно начинают садиться на своих койках."

    "Один за другим они встают на ноги, будто откликнувшись на беззвучный приказ. 
    Именно тогда из глубины собора доносятся первые встревоженные крики."

    jump awakening_temple

label awakening_temple:
    if hero.prof == PROF.MONK:
        play music "<from 147.0>audio/epic_theme.m4a"

        $ hard_fade("temple_inside", 3.0, "Вы быстро поднимаетесь по лестнице обратно к главному залу. С каждой ступенькой чувство тревоги накатывает на вас все сильнее.")

        show sleepwalkers default at center
        with dissolve

        "Вы врываетесь в главный зал собора вместе настоятелем. 
        Ты видишь, как большинство прихожан в ужасе жмутся к стенам." 
        
        "В центре зала толпятся несколько десятков спящих, среди которых и прихожане, и монахи, и певцы хора.
        с закрытыми глазами они медленно идут вперед, не реагируя ни на что вокруг."

        hide sleepwalkers default
        show stefan default at center
        with dissolve
    else:
        play music "<from 147.0>audio/epic_theme.m4a"

        $ hard_fade("temple_inside", 3.0)

        show sleepwalkers default at center
        with dissolve

        "Вы врываеетесь в главный зал собора вместе в другими монахами.
        Ты видишь, как большинство прихожан в ужасе жмутся к стенам." 
        
        "В центре зала толпятся несколько десятков спящих, среди которых и прихожане, и монахи, и певцы хора.
        с закрытыми глазами они медленно идут вперед, не реагируя ни на что вокруг."

        "Ты слышишь, как в другом конце зала отец Стефан уже отдает приказы."

        hide sleepwalkers default
        show stefan default at center
        with dissolve

    stefan "Закройте двери! Не дайте им выйти в город!"

    hide stefan default
    show sleepwalkers default at center
    with dissolve

    "Один из монахов пытается остановить женщину в грязном белом платке, преградив ей путь, 
    но та буквально опрокидывает его, продолжая идти вперед."
    "Второй монах хватает за руку приведенного недавно мальчика,
    но тот вырывается с неожиданной силой и бредет по направлению к выходу, словно ведомый незримой силой."

    "Отец Стефан быстро отдает распоряжения, перебрасывая своих людей от одного прохода к другому."
    "По его лицу видно, что он пытается хоть как-то контролировать происходящее, 
    но лунатики продолжают возникать в разных частях собора и каждый раз обходят препятствия, будто заранее знают, где их встретят."

    "Несколько братьев опрокидывают тяжелые деревянные скамьи поперек центрального нефа, превратив их в подобие баррикады."
    "Однако лунатики не останавливаются — они медленно перелезают через препятствия или сворачивают в боковые проходы, 
    продолжая двигаться к выходу с пугающим упорством."

    "Ты видишь, что у главных ворот, несмотря на приказ отца Стефана, царит неразбериха."

    "Пока одни монахи пытаются закрыть тяжелые створки, другие выводят испуганных людей из давки, возникшей перед выходом."
    "Несколько прихожан в панике наваливаются на двери, стремясь покинуть собор, мешая монахам к ним пробиться."

    "К тому моменту, как братьям удается расчистить проход и взяться за створки, 
    большинство спящих уже оказывается на улице..."

    jump morvein_from_temple

label morvein_from_temple:
    scene morvein_from_temple 
    with fade

    hide sleepwalkers default 
    with dissolve

    show stefan default at center 
    with dissolve

    "Вы с отцом Стефаном выбегаете на широкую площадку перед собором и замираете."
    "Отсюда весь Морвейн лежит как на ладони: лабиринт тесных улиц, крыши, теряющиеся в тумане, и редкие огни в окнах."
    "По всему городу двигаются люди — десятки, а может быть, сотни фигур медленно выходят из домов, переулков и дворов, 
    сливаясь в длинные безмолвные потоки"

    menu:
        "Что нам делать?":
            "Отец Стефан не отвечает. Его взгляд прикован к людям вдалеке."
            "По его остекленевшим глазам ты понимаешь: он впервые не знает, что происходит..."

    hide stefan default
    with dissolve
    show beggar default at center
    with dissolve

    "Перед вами неожиданно возникает нищий, которого вы видели перед входом в собор. 
    Он резко кидается в вашу сторону с закрытыми глазами и зажатым в руке камнем."

    if beggar_flag_help:
        "В последний момент, словно на мнговение узнав тебя, калека в словно замешательстве останавливается. 
        И через пару секунд падает на землю без сознания."
    else:
        "Калека бросает в твою голову камень, после чего падает на землю без сознания."
        show screen blood_overlay(hero)
        $ hero.state = STATE.INJURED
        "Ты с ужасом понимаешь, что это первый раз, когда кто-то из спящих попытался напасть на человека."
        $ hard_fade("black", 3.0)


    hide beggar default 
    with dissolve

    jump prologue_end

label prologue_end:
    scene black 
    with fade 

    hide screen gui

    image tbc_message = Text("ПРОДОЛЖЕНИЕ СЛЕДУЕТ", style="death_style")

    show expression "images/misc/hourglass.png" at Transform(xalign=0.5, yanchor=0.5, ypos=0.40)
    show tbc_message at Transform(xalign=0.5, yanchor=0.5, ypos=0.80)

    $ renpy.take_screenshot()
    $ renpy.save("1-1", "Конец пролога")


    $ renpy.pause()

    jump act_1_hospital_before_start


label act_1_hospital_before_start:
    play music "hospital.mp3" fadein 3.0

    $ hard_fade("bed_view", 3.0)

    $ hero.state = STATE.HEALTHY

    narrator "Ты открываешь глаза и несколько секунд смотришь в деревянный потолок. 
    В голове шумит, а каждый вдох отзывается тупой болью в голове."
    "Помещение кажется тебе смутно знакомым. Спустя несколько секунд ты понимаешь, что находишься в храмовой лечебнице."
    "Справа от тебя сидит незнакомый человек в монашеской рясе. Заметив движение, он откладывает книгу и поднимается на ноги."
    
    show mattias default at center 
    with dissolve

    mattias "О, ты снова с нами, соня"
    mattias "Я брат Маттиас, присматриваю за этой лечебницей."
    mattias "И за тобой, пока ты не поправишься."

    "Ты видишь легкую улыбку на его лице, которая кажется неуместной в такой обстановке, но выглядит очень искренней."

    menu:
        "Сколько я уже здесь? И что с отцом Стефаном?":
            mattias "Ты здесь уже пару дней. К счастью, твои раны оказались не слишком серьезными. 
                Через несколько дней ты уже полностью поправишься."
            narrator "Выражение лица Маттиаса мрачнеет."
            mattias "Что касается отца Cтефана — он жив. Но травма очень тяжелая, мы боремся за его жизнь все это время.
                Орден не может позволить себе потерять такого человека, как он."
            mattias "Всеми делами сейчас временно управляет совет Ордена."
    
    if hero.prof == PROF.DOCTOR:
        menu:
            "Совет Ордена?":
                mattias "Да, это группа старших братьев, которые принимают решения в отсутствие отца Стефана."

    mattias "Им пришлось действовать быстро и решительно, чтобы навести порядок после произошедшего."
    mattias "Сотни людей бесследно исчезли этой ночью."
    mattias "Все выходы из города сейчас закрыты, а на улицах введен комендантский час."
    mattias "И еще одно."
    mattias "Совет хочет встретится с тобой. Ведь ты последний, кто видел отца Стефана в сознании."
    mattias "А сейчас — отдыхай. Продолжим наш разговор позднее."

    hide mattias default at center 
    with dissolve

    call dream_scene(
    [
        "Ты слышишь колокола и шум прибоя...",
        "Они звучат все ближе...",
    ],
    [
        "Они уже ушли.",
        "Ты ещё можешь их догнать...",
        "Нет, ты уже не сможешь!",
        "Ты опоздал...",
        "Когда настанет час - бойся Прилива!"
    ],
    False)
    
    show mattias default at center 
    with dissolve

    "Брат Маттиас встревоженно подбегает к тебе."

    mattias "Что случилось?"
    mattias "Твои крики были слышны на весь собор."

    "Ты рассказываешь брату Маттиасу об увиденном тобой кошмаре."
    "При воспоминаниях об отце Стефане с его белыми зрачками и жуткой ухмылкой по твоему телу бежит холодная дрожь."
    if(hero.prof == PROF.MONK):
        "В твоей памяти всплывают жуткие сны, которые ты уже видел когда-то в стенах Собора."
    elif(hero.prof == PROF.DOCTOR):
        "Никогда в своей жизни ты не видел таких жутких снов."
    "Монах ободряюще сжимает твое плечо."

    mattias "В последнее время люди видят кошмары все чаще..."
    "Отец Маттас протягивает тебе пузырек с искрящейся желтой жидкостью."
    mattias "Вот, возьми."
    mattias "Если ужасы начнут одолевать тебя, то выпей это зелье."
    if(hero.prof == PROF.MONK):
        mattias "Сам знаешь, как Орден дорожит этими эликсирами."
    elif(hero.prof == PROF.DOCTOR):
        mattias "Используй его с умом. Орден обычно не раздает эти эликсиры никому, кроме самих братьев."
    mattias "Такими темпами придется раздавать их всем жителям города..."
    "В воздухе повисает долгое молчание, сопровождаемое лишь дыханием твоего собеседника."
    "Ты чувствуешь, что сознание снова начинает покидать тебя."
    "Маттиас, заметив это, беззвучно отступает от кровати и выходит за дверь."
    "Последнее, что ты слышишь перед погружением в сон, это звук удаляющихся шагов..."

    hide mattias default
    with dissolve

    $ hard_fade("bed_view", 3.0)
    
    "Проснувшись снова, ты чувствуешь, что силы вернулись к тебе."
    "Голова всё ещё слегка кружится, но кошмар отступил, оставив после себя лишь смутное беспокойство."
    "Некоторое время ты лежишь неподвижно, глядя в потолок лечебницы."
    "Поднявшись на ноги спустя время, ты замечаешь, что за окном уже давно рассвело. Пора действовать."

    scene temple_inside 
    with long_fade

    "Собор сильно изменился за время, пока ты спал."
    "Повсюду снуют братья Ордена с книгами и ветхими свитками в руках."
    "Помещение наводнили храмовые стражи, которых ты никогда не видел до этого в таком количестве."
    "Становится очевидным: уклад жизни города изменился навсегда."
    "Осталось лишь понять, что делать дальше."

    $ renpy.take_screenshot()
    $ renpy.save("1-2", "Начало 1 акта")

    jump act_1_start

label act_1_start:
    scene temple_inside
    with long_fade

    show screen gui
    with fade

    $ inventory_items = [
        InvItem("coins", "Золото", "images/misc/coins.png", "Золотая марка Морвейна. Причина людского раздора во все времена.", 300),
        InvItem("potion_hp", "Зелье исцеления", "images/misc/potion.png", "Колба с мерцающей красной жидкостью внутри. Исцеляет даже самые тяжелые раны.", 1),
        InvItem("potion_energy", "Зелье бодрости", "images/misc/potion_energy.png", "Редкое зелье, изготавливаемое алхимиками Ордена из черного вереска. Выпей - и кошмары отступят.", 1),
    ]

    menu:
        "Искать улики в городе":
            jump act_1_own_investigation_start
        "Отправиться к Совету":
            jump act_1_order_council

label act_1_neutral_streets:
    scene morvein_streets
    with fade

    "Собственное расследование..."

    return

label act_1_order_council:
    scene temple_council
    with fade

    "Ты подходишь к резным дверям, которые охраняет угрожающего вида храмовый страж."
    "Он одаривает тебя недовольным взглядом, словно его отвлекли от чего-то важного, после чего нехотя молча приоткрывает двери."
    "Ты входишь в зал и спустя пару секунд слышишь за собой грохот закрывающихся тяжелых створок."

    scene temple_council
    with fade

    "Впереди от тебя, за массивным каменным столом, сидят трое старших братьев Ордена."
    "В полумраке их лица кажутся высеченными из серого камня."
    "Несколько мгновений никто не произносит ни слова."
    "Затем сидящий по центру монах встает и скрипучим голосом обращается к тебе."

    $ dream_char("edmund default", [center])

    edmund "Доброе утро, [hero.full_name], мы вас ждали."
    edmund "Вы были последним, кто видел отца Стефана в сознании."
    edmund "И у нас есть к вам пара вопросов."
    edmund "TBD"

    narrator "TBD"

    if (hero.prof == PROF.MONK) or (hero.ord_rel > 2):
        if (hero.prof == PROF.MONK):
                edmund "Совет доверяет вам, [hero.full_name]. Можете обратиться к брату Корнелиусу, как обычно."
        else:
            edmund "Что же, совет доверяет вам, поэтому вы получите доступ к архиву."
            edmund "Покажите эту печать брату Корнелиусу, он вас впустит."

        jump act_1_order_archives
    else:
        edmund "У Совета нет причины доверять незнакомцам, хотя отец Стефан и пригласил вас помочь ему"
        edmund "Но всякое доверие можно заслужить."
        edmund "Мы слышали, в городе появился торговец фальшивым черным вереском."
        edmund "Как вам может быть известно, Орден делает из него эликсиры бодрости."
        edmund "Сами понимаете, какое помешательство в городе начнется, если зелья из этой дряни попадут на прилавки.в"
        edmund "Сумеете разобраться с проблемой — получите доступ в наши архивы."
        edmund "Если не справитесь — тогда вам точно нечего делать в архивах."
        
        jump act_1_agatha_quest


label act_1_order_archives:
    scene temple_archives
    with fade

    $ dream_char("cornelius default", [center])

    cornelius "Дарова!"

    return

label act_1_agatha_quest:
    scene morvein_streets_mix
    with fade

    narrator "Вы выходите из собора и возвращаетесь в город."
    narrator "Тут незнакомая бабища."

    $ dream_char("agatha_default", [center])

    agatha "Привет, красавчик!"

    menu:
        "Обратиться мирно":
            "Ты просишь ее мирно ее прекратить."
        "Грубо прервать ее":
            "Ты бьешь ее палицей по голове."
    
    narrator "Агата кидает тебе в лицо кипу вереска и убегает прочь."
    
    hide agatha_default
    with dissolve

    # call dream_scene(
    # [
    #     [
    #         "На короткое мгновение у тебя темнеет в глазах"
    #     ],
    #     [],
    #     [],
    #     False
    # ])

    show screen gui

    narrator "Ты гонишься за ней."

    if hero.dream >= 0:
        narrator "Ты ввидишь скрытый путь"
        narrator "Ты настигаешь ее."

        menu:
            "Cхватить ее и доставить в собор":
                $ hero.ord_rel += 1
                $ council_help_flag = True
                $ agatha_release_flag = False
            "Отпустить ее":
                $ hero.ord_rel -= 1
                $ hero.cult_rel += 1
                $ agatha_release_flag = True
                $ council_help_flag = False
    else:
        narrator "Ты упускаешь ее."
        $ hero.ord_rel -= 1
        $ council_help_flag = False

    scene temple_council
    with fade

    show edmund default at center
    with dissolve

    if council_help_flag:
        edmund "Мы разочарованы"
        return
    else:
        "Мы довольны, го в архив"
        jump act_1_order_archives

label dream_scene(texts_start, texts_horror = [], texts_end = [], show_gui_after = True):
    hide screen gui
    with fade
    
    $ start_dream_effect()

    $ old_skip = preferences.skip_unseen
    $ preferences.skip_unseen = False

    with long_fade

    python:
        for text in texts_start:
            dream(text)
            renpy.pause(2.0, hard=True)

    if texts_horror:
        show stefan horror with dissolve
        python:
            for text in texts_horror:
                horror(text)
                renpy.pause(2.0, hard=True)
        hide stefan horror with long_fade

    if texts_end:
        python:
            for text in texts_end:
                dream(text)
                renpy.pause(2.0, hard=True)

    with long_fade

    if show_gui_after:
        show screen gui (hero)
        with fade

    $ stop_dream_effect()

    $ preferences.skip_unseen = old_skip
    
